app/views/users/show.html.erb

                      <%= link_to book_favorites_path(book), method: :delete do %>
                        <i class="fas fa-heart"></i><%= book.favorites.count %>
---
SELECT COUNT(*) FROM "favorites" WHERE "favorites"."book_id" = ?  [["book_id", 6]]

                      <%= link_to book_favorites_path(book), method: :post do %>
                        <i class="fas fa-heart"></i><%= book.favorites.count %>
---
SELECT COUNT(*) FROM "favorites" WHERE "favorites"."book_id" = ?  [["book_id", 6]]