app/views/books/index.html.erb

SELECT COUNT(*) FROM "favorites" WHERE "favorites"."book_id" = ?  [["book_id", 1]]
---
                        <%= link_to book_favorites_path(book), method: :delete do %>
                          <i class="fas fa-heart"></i><%= book.favorites.count %>

SELECT COUNT(*) FROM "favorites" WHERE "favorites"."book_id" = ?  [["book_id", 1]]
---
                        <%= link_to book_favorites_path(book), method: :post do %>
                          <i class="fas fa-heart"></i><%= book.favorites.count %>

SELECT COUNT(*) FROM "post_comments" WHERE "post_comments"."book_id" = ?  [["book_id", 1]]
SELECT "books".* FROM "books"
SELECT COUNT(*) FROM "book_comments" WHERE "book_comments"."book_id" = ?  [["book_id", 1]]
---
                  </td>
                  <td><p><%= link_to "コメント数#{book.book_comments.count} ", book_path(book.id) %></p>