app/views/books/show.html.erb

SELECT COUNT(*) FROM "favorites" WHERE "favorites"."book_id" = ?  [["book_id", 1]]
---
                      <%= link_to book_favorites_path(@book), method: :delete do %>
                        <i class="fas fa-heart"></i><%= @book.favorites.count %>

SELECT COUNT(*) FROM "favorites" WHERE "favorites"."book_id" = ?  [["book_id", 1]]
---
                      <%= link_to book_favorites_path(@book), method: :post do %>
                        <i class="fas fa-heart"></i><%= @book.favorites.count %>

SELECT "book_comments".* FROM "book_comments" WHERE "book_comments"."book_id" = ?  [["book_id", 1]]
SELECT COUNT(*) FROM "book_comments" WHERE "book_comments"."book_id" = ?  [["book_id", 1]]
---
                  <p>
                    コメント数：<%= @book.book_comments.count %>

SELECT "book_comments".* FROM "book_comments" WHERE "book_comments"."book_id" = ?  [["book_id", 1]]
---
          <div class="comments">
            <% @book.book_comments.each do |book_comment| %>