app/controllers/books_controller.rb

INSERT INTO "books" ("user_id", "body", "title", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["user_id", 2], ["body", "orange1"], ["title", "orange1"], ["created_at", "2021-08-10 18:50:32.486411"], ["updated_at", "2021-08-10 18:50:32.486411"]]
---
  def create
    @book = Book.new(book_params)
    @book.user_id = current_user.id
    if @book.save

SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def update
    @book = Book.find(params[:id])

SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
DELETE FROM "books" WHERE "books"."id" = ?  [["id", 3]]
---
  def destroy
    book = Book.find(params[:id])
    book.destroy