app/controllers/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "profile_image_id" = ?, "introduction" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["profile_image_id", "091a0af0967be03d333c463e27928f42e97f42ca7d019dc2b61e10763705"], ["introduction", "momo"], ["updated_at", "2021-08-10 05:48:41.465137"], ["id", 1]]
---
  def update
    @user = User.find(params[:id])
    if @user.update(user_params)